print("---------------------------------------------------------------------------------")
print('EXEMPLO - 5. or - OU lógico (pelo menos uma condição é verdade)')
print("---------------------------------------------------------------------------------")

feriado = True
final_semana = False

if feriado or final_semana:
    print("=================================================================================")
    print("Dia de descanso!")  # Executa porque feriado é True
    print("=================================================================================")